// messages パッケージは、メッセージIDのコードを管理します
package message

const (
	// 情報メッセージID
	I_EX_0001 = "i.ex.0001"
	I_EX_0002 = "i.ex.0002"
	I_EX_0003 = "i.ex.0003"

	// 入力エラーメッセージID（エラーコード）
	W_EX_5001 = "w.ex.5001"
	W_EX_5002 = "w.ex.5002"

	// 業務エラーメッセージID（エラーコード）
	W_EX_8001 = "w.ex.8001"
	W_EX_8002 = "w.ex.8002"
	W_EX_8003 = "w.ex.8003"
	W_EX_8004 = "w.ex.8004"
	W_EX_8005 = "w.ex.8005"
	W_EX_8006 = "w.ex.8006"
	W_EX_8007 = "w.ex.8007"
	W_EX_8008 = "w.ex.8008"

	// システムエラーメッセージID（エラーコード）
	E_EX_9001 = "e.ex.9001"
	E_EX_9002 = "e.ex.9002"
	E_EX_9003 = "e.ex.9003"
	E_EX_9999 = "e.ex.9999"
)
